tap "aws/tap"
tap "dart-lang/dart"
tap "go-delve/delve"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "readline", link: true
brew "awscli"
brew "bat"
brew "cocoapods", link: false
brew "direnv"
brew "exercism"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "go"
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-libav"
brew "gst-plugins-bad"
brew "pkg-config"
brew "gst-plugins-good"
brew "gst-plugins-ugly"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "ios-deploy"
brew "iproute2mac"
brew "jenv"
brew "jq"
brew "libusbmuxd", args: ["HEAD"]
brew "mysql@5.7"
brew "ndenv"
brew "neovim"
brew "nodebrew"
brew "opencv"
brew "pandoc"
brew "peco"
brew "postgresql"
brew "pstree"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn", link: false
brew "zsh"
brew "aws/tap/aws-sam-cli"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku"
cask "chromedriver"
cask "ngrok"
