# =============================================================================
# Homebrew Brewfile
# =============================================================================

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "aws/tap"
# tap "homebrew/bundle"  # deprecated
# tap "koekeishiya/formulae"  # yabai (CI環境で利用不可)

# -----------------------------------------------------------------------------
# Formulae - Core
# -----------------------------------------------------------------------------
brew "git"
brew "vim"
brew "neovim"
brew "tmux"
brew "readline", link: true
brew "wget"
brew "tree"
brew "pstree"

# -----------------------------------------------------------------------------
# Formulae - Shell & Search
# -----------------------------------------------------------------------------
brew "fzf"
brew "peco"
brew "ripgrep"
brew "the_silver_searcher"
brew "bat"
brew "atuin"
brew "zoxide"
brew "direnv"
brew "jq"
brew "sheldon"
brew "chezmoi"

# -----------------------------------------------------------------------------
# Formulae - Modern CLI Tools
# -----------------------------------------------------------------------------
brew "just"           # タスクランナー（Makefile代替）
brew "yazi"           # TUIファイルマネージャー
brew "gitui"          # 高速Git TUI
brew "procs"          # ps代替（カラフル表示）
brew "bottom"         # htop代替（システムモニター）
brew "hyperfine"      # コマンドベンチマーク
brew "dust"           # du代替（ディスク使用量可視化）
brew "sd"             # sed代替（検索・置換）
brew "xh"             # curl代替（HTTPクライアント）
brew "topgrade"       # 全ツール一括アップデート

# -----------------------------------------------------------------------------
# Formulae - Git & Repository
# -----------------------------------------------------------------------------
brew "gh"
brew "ghq"
brew "tig"

# -----------------------------------------------------------------------------
# Formulae - Development Languages
# -----------------------------------------------------------------------------
brew "go"
brew "golangci-lint"
brew "protobuf"
brew "sqlc"

# -----------------------------------------------------------------------------
# Formulae - Version Managers (mise移行後に削除予定)
# -----------------------------------------------------------------------------
# brew "rbenv"
# brew "ruby-build"
# brew "pyenv"
# brew "nodebrew"
brew "mise"

# -----------------------------------------------------------------------------
# Formulae - Database
# -----------------------------------------------------------------------------
brew "mysql"
brew "postgresql@15"
brew "redis"
brew "sqlite"

# -----------------------------------------------------------------------------
# Formulae - Container & Virtualization
# -----------------------------------------------------------------------------
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"

# -----------------------------------------------------------------------------
# Formulae - Cloud & Infrastructure
# -----------------------------------------------------------------------------
brew "awscli"
brew "aws/tap/aws-sam-cli"
brew "azure-cli"
# brew "terraform"  # tfenv で管理
brew "tfenv"

# -----------------------------------------------------------------------------
# Formulae - Media & Misc
# -----------------------------------------------------------------------------
brew "ffmpeg"
brew "hugo"
brew "act"  # GitHub Actions local runner
brew "wireshark"

# -----------------------------------------------------------------------------
# Formulae - Window Manager
# -----------------------------------------------------------------------------
# brew "yabai"  # CI環境で利用不可

# -----------------------------------------------------------------------------
# Casks - Browsers
# -----------------------------------------------------------------------------
cask "arc"
cask "google-chrome"

# -----------------------------------------------------------------------------
# Casks - Terminals
# -----------------------------------------------------------------------------
cask "ghostty"
cask "iterm2"
cask "warp"
cask "wezterm"

# -----------------------------------------------------------------------------
# Casks - Editors & IDEs
# -----------------------------------------------------------------------------
cask "cursor"
cask "visual-studio-code"
cask "goland"

# -----------------------------------------------------------------------------
# Casks - Database Tools
# -----------------------------------------------------------------------------
cask "dbeaver-community"
cask "db-browser-for-sqlite"
cask "sequel-ace"

# -----------------------------------------------------------------------------
# Casks - Development Tools
# -----------------------------------------------------------------------------
cask "chromedriver"
cask "github"
cask "ngrok"
cask "mitmproxy"

# -----------------------------------------------------------------------------
# Casks - AI & Productivity
# -----------------------------------------------------------------------------
cask "chatgpt"
cask "claude"
cask "deepl"
cask "obsidian"
cask "raycast"

# -----------------------------------------------------------------------------
# Casks - Communication
# -----------------------------------------------------------------------------
cask "discord"
cask "slack"
cask "zoom"

# -----------------------------------------------------------------------------
# Casks - Utilities
# -----------------------------------------------------------------------------
cask "1password"
cask "1password-cli"
cask "clipy"
cask "dockdoor"
cask "figma"
cask "jordanbaird-ice"
cask "meetingbar"
# cask "skitch"  # 利用不可
