tap "aws/tap"
tap "dart-lang/dart"
tap "go-delve/delve"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "readline", link: true
brew "awscli"
brew "bat"
brew "direnv"
brew "fzf"
brew "go"
brew "jenv"
brew "jq"
brew "nodebrew"
brew "peco"
brew "pstree"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "aws/tap/aws-sam-cli"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku"

cask "chromedriver"
cask "ngrok"
